var models = angular.module( 'tamilapp.constants' );
models.factory( 'splitRulesTypes', function() {
  var rules = [
   { id: 1, name: 'All', description: 'All' },
   { id: 2, name: 'இயல்புபுணர்ச்சி -1', description: 'இயல்புபுணர்ச்சி -1' },
   { id: 3, name: 'நன்னூல்விதி-164_2', description: 'நன்னூல்விதி-164_2' },
   { id: 4, name: 'நன்னூல்விதி-158_1', description: 'நன்னூல்விதி-158_1' },
   { id: 5, name: 'நன்னூல்விதி-158_2', description: 'நன்னூல்விதி-158_2' },
   { id: 6, name: 'நன்னூல்விதி-158_3_1', description: 'நன்னூல்விதி-158_3_1' },
   { id: 7, name: 'நன்னூல்விதி-158_3_2', description: 'நன்னூல்விதி-158_3_2' },
   { id: 8, name: 'நன்னூல்விதி-163_1', description: 'நன்னூல்விதி-163_1' },
   { id: 9, name: 'நன்னூல்விதி-163_2', description: 'நன்னூல்விதி-163_2' },
   { id: 10, name: 'தன்னொற்று இரட்டித்தில்', description: 'தன்னொற்று இரட்டித்தில்' },
   { id: 11, name: 'உடம்படுமெய்த்தோன்றல்', description: 'உடம்படுமெய்த்தோன்றல்' },
   { id: 12, name: 'உயிர்வரின் உக்குறள் மெய்விட்டோடும்  ', description: 'உயிர்வரின் உக்குறள் மெய்விட்டோடும்  ' },
   { id: 13, name: 'நன்னூல்விதி-165 - க ச த ப மிகும்;(பொது)', description: 'நன்னூல்விதி-165 - க ச த ப மிகும்;(பொது)' },
   { id: 14, name: 'நன்னூல்விதி-170_1(பல,பல)', description: 'நன்னூல்விதி-170_1(பல,பல)' },
   { id: 15, name: 'நன்னூல்விதி-219(மவ்வீறு)', description: 'நன்னூல்விதி-219(மவ்வீறு)' },
   { id: 16, name: 'நன்னூல்விதி-237 -  னலமுன் றனவும் ணளமுன் டனவும் ஆகும்  &quot;தந&quot; க்கள் ', description: 'நன்னூல்விதி-237 -  னலமுன் றனவும் ணளமுன் டனவும் ஆகும்  &quot;தந&quot; க்கள் ' },
   { id: 17, name: 'இயல்புபுணர்ச்சி -2>இயல்புபுணர்ச்சி -2', description: 'இயல்புபுணர்ச்சி -2>இயல்புபுணர்ச்சி -2' },
   { id: 18, name: 'நெடிலுயிர்வரின் குறிலுயிர்  மெய்விட்டோடும் (போன + ஆல் = போனால்)>நெடிலுயிர்வரின் குறிலுயிர்  மெய்விட்டோடும் (போன + ஆல் = போனால்)', description: 'நெடிலுயிர்வரின் குறிலுயிர்  மெய்விட்டோடும் (போன + ஆல் = போனால்)>நெடிலுயிர்வரின் குறிலுயிர்  மெய்விட்டோடும் (போன + ஆல் = போனால்)' },
   { id: 19, name: 'கள்-விகுதி >  கள்-விகுதி  ', description: 'கள்-விகுதி >  கள்-விகுதி  ' },
   { id: 20, name: 'நன்னூல்விதி-227(லகர, ளகரவிதி)>நன்னூல்விதி-227(லகர, ளகரவிதி) ', description: 'நன்னூல்விதி-227(லகர, ளகரவிதி)>நன்னூல்விதி-227(லகர, ளகரவிதி) ' },
   { id: 21, name: 'நன்னூல்விதி183(நெடிலோ டுயிர்த்தொடர்க் குற்றுக ரங்களுட்டறவொற் றிரட்டும்)', description: 'நன்னூல்விதி183(நெடிலோ டுயிர்த்தொடர்க் குற்றுக ரங்களுட்டறவொற் றிரட்டும்)' },
   { id: 22, name: 'வேற்றுமை', description: 'வேற்றுமை' }
  ];
  return rules;
} );